{
  "name": "Ryan Boone",
  "title": "Front-End Engineer",
  "employer": {
    "name": "The Container Store",
    "address": {
      "street": "500 Freeport Pkwy",
      "street2": "#100",
      "city": "Coppell",
      "state": "TX",
      "postalCode": "75019"
    }
  },
  "bio": {
    "short": "I’m a front-end developer and designer based in Fort Worth, TX with a passion for web technologies, inclusivity, and Texas BBQ. I currently help make the space that comes from The Container Store."
  },
  "contact": {
    "phone": 4093441799,
    "email": "falldowngoboone@gmail.com",
    "twitter": "https://twitter.com/therealboone",
    "website": "https://www.falldowngoboone.com"
  },
  "experience": [
    {
      "title": "Design Tools React Developer",
      "company": "The Container Store",
      "location": "Coppell, TX, USA",
      "startDate": {
        "month": 7,
        "year": 2018
      },
      "current": true,
      "description": "I work with UX to build performant, accessible UI, as well as develop solutions to novel front-end challenge, and audit and utilize an array of front-end development tools and techniques.\n\n• I rebuilt our e-commerce site's header and footer.\n• I retooled our front-end workflow to support modern JavaScript.\n• I built React support into our Java development environment, marrying Spring and Create React App.\n• I replaced our outdated CSS workflow with a Sass-based, utility-first approach.\n• I facilitate our JavaScript Special Interest Group, a group of developers that help dictate best practices for JS at The Container Store.\n• I am also a champion for accessibility."
    },
    {
      "title": "Design Tools React Developer",
      "company": "The Container Store",
      "location": "Coppell, TX, USA",
      "startDate": {
        "month": 10,
        "year": 2017
      },
      "endDate": {
        "month": 7,
        "year": 2018
      },
      "description": "I worked with a small group of talented developers to create the next generation of customer-facing design tools, using React to create both browser and Electron-based applications for desktop and mobile environments.\n\n• I developed a custom drag-and-drop solution to support both touchscreen and mouse interaction.\n• I led a team that increased performance of our Door and Wall Rack tool using Redux."
    },
    {
      "title": "E-commerce Applications Associate",
      "company": "The Container Store",
      "location": "Coppell, TX, USA",
      "startDate": {
        "month": 7,
        "year": 2017
      },
      "endDate": {
        "month": 10,
        "year": 2017
      },
      "description": "I collaborated with team members on our Java-based e-commerce application and supporting systems.\n\n• I worked on the redesign of our Elfa system marketing pages.\n• I participated in our monthly Hackathon challenge and was on three consecutive winning teams."
    },
    {
      "title": "Freelance Front-End Developer and Web Designer",
      "company": "Self employed",
      "location": "Dallas/Fort Worth Area",
      "startDate": {
        "month": 10,
        "year": 2015
      },
      "current": true,
      "description": "My most recent freelance project was a website redesign for Olive — The Beauty Lounge, an upscale salon based in Mansfield, TX.\n\n• Build and maintain custom WordPress themes\n• Interview the client, discuss business needs, establish goals, and carry out solutions\n• Google Maps and social media integration"
    },
    {
      "title": "Senior Designer",
      "company": "INPROV, Ltd",
      "location": "Southlake, TX, USA",
      "startDate": {
        "month": 11,
        "year": 2006
      },
      "endDate": {
        "month": 7,
        "year": 2017
      },
      "description": "Inprov is a donor development agency based in North Texas that works with non-profit and charitable organizations.\n\n• I work with organizations to produce promotional materials with tight budgets and deadlines to create opportunities for high return on investment.\n• One of the challenges I face every day is creating new and interesting ways to present the same message in a recurring format.\n• When our company rebranded I jumped at the opportunity to build the new company website.\n• I have also developed one-off promotional web pages for clients involving custom web forms and PHP/JavaScript development."
    }
  ]
}
