{
  "basics": {
    "name": "Ryan Boone",
    "label": "Front-End Engineer",
    "picture": "",
    "email": "falldowngoboone@gmail.com",
    "phone": "(409) 344-1799",
    "website": "https://www.falldowngoboone.com",
    "summary": "I’m a front-end developer and designer based in Fort Worth, TX with a passion for web technologies, inclusivity, and Texas BBQ. I currently help make the space that comes from The Container Store.",
    "location": {
      "address": "2424 Loreto Drive",
      "postalCode": "TX 76177",
      "city": "Fort Worth",
      "countryCode": "US",
      "region": "Texas"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "therealboone",
        "url": "https://twitter.com/therealboone"
      }
    ]
  },
  "work": [
    {
      "title": "E-Commerce Front-End Engineer",
      "company": "The Container Store",
      "location": "Coppell, TX, USA",
      "startDate": "2018-06-22",
      "description": "I work with our UX team to build performant, accessible UI, as well as develop solutions to novel front-end challenges. I also audit and implement an array of front-end development tools and techniques to improve our front-end performance.",
      "highlights": [
        "Retooled our front-end workflow to support modern JavaScript.",
        "Heavily contributed to building a brand-new single-page check out experience using React and a Java backend",
        "Built React support into our Java development environment, marrying Spring and Create React App",
        "Updated our CSS workflow with a Sass-based, utility-first approach",
        "I facilitate our JavaScript Special Interest Group, a group of developers that help dictate best practices for JS at The Container Store",
        "I also am a vocal champion for accessibility at The Container Store"
      ]
    },
    {
      "name": "The Container Store",
      "position": "Design Tools React Developer",
      "location": "Coppell, TX, USA",
      "startDate": "2017-12-03",
      "endDate": "2018-06-22",
      "description": "I worked with a small group of talented developers to create the next generation of customer-facing design tools, using React to create both browser and Electron-based applications for desktop and mobile environments.",
      "highlights": [
        "Developed a custom drag-and-drop solution to support both touchscreen and mouse interaction",
        "Reworked the Redux implementation on one tool, which led to a conservative 50% increase in performance"
      ]
    },
    {
      "name": "The Container Store",
      "position": "E-commerce Applications Associate",
      "location": "Coppell, TX, USA",
      "startDate": "2017-07-05",
      "endDate": "2017-12-03",
      "summary": "I collaborated with team members on our Java-based e-commerce application and supporting systems, mostly assisting with implement front-end behavior with JavaScript and styling UI with CSS.",
      "highlights": [
        "Paired with team members to rework the site's mobile navigation",
        "Worked on the redesign of our popular Elfa shelving system marketing pages",
        "Participated in our monthly Hackathon challenge and was on three consecutive winning teams"
      ]
    },
    {
      "name": "INPROV, Ltd.",
      "position": "Senior Designer",
      "website": "https://www.inprov.com",
      "startDate": "2006-11-06",
      "endDate": "2017-06-30",
      "location": "Southlake, TX, USA",
      "summary": "For over a decade, I helped build the brands of non-profit organizations, producing marketing materials for donor development, including book design, video packaging, and brochure websites.",
      "highlights": [
        "Worked with organizations to produce promotional materials with tight budgets and deadlines to create opportunities for high return on investment",
        "Created new and interesting ways to present the same message in a recurring format",
        "Built the company website from scratch after a rebrand",
        "Developed one-off promotional web pages for clients involving custom web forms and PHP/JavaScript development"
      ]
    }
  ],
  "education": [
    {
      "institution": "Lamar University, Beaumont, TX",
      "area": "Communications, emphasis in Broadcast/Film",
      "studyType": "Bachelor",
      "startDate": "1998-08-01",
      "endDate": "2002-11-22"
    }
  ],
  "skills": [
    {
      "name": "Web Development",
      "level": "Competent",
      "keywords": ["HTML", "CSS", "Javascript"]
    },
    {
      "name": "Design",
      "level": "Competent",
      "keywords": ["typography", "book design", "form design", "web design"]
    }
  ]
}
